import React from 'react';
import './Question.css'

const Question = () => {
    return (
        <div>
           <h3 className='question1'>
            Question-1:-React জিনিস টা কিভাবে কাজ করে?
            <p className='question-items'>
                উত্তরঃ আমরা সাধারণত ওয়েবসাইটে এইচটিএমএল, সিএসএস সহ জাভাস্ক্রিপ্ট ইউজ করি। এখন ব্রাউজার বিহ্যাইন্ড দ্যা সীনে একটা ডম ট্রি তৈরী করে যাতে ইউজার সেই ডমের সাথে ইন্টার‍্যাক্ট করতে পারে। ব্রাউজারের এই প্রসেসটাকে ক্রিটিক্যাল রেন্ডার পাথ [] বলে  এভাবে একেকটা ধাপ পেরিয়ে একটা ডম (DOM) তৈরী করা হয়। তারপরে আমাদের সামনে একটা ওয়েবপেজ প্রদর্শিত হয়। কিন্তু আমরা জানি জাভাস্ক্রিপ্ট ডম ম্যানিপুলেট করতে পারে। তো জাভাস্ক্রিপ্ট দিয়ে রেন্ডার কমপ্লিট হওয়া কোন পেজের ডম ম্যানিপুলেট করলে সেই ওয়েবপেজ আবার পুরোপুরি রেন্ডার হয়(দুই একটা লেটেস্ট ব্রাউজার ছাড়া বাকী বেশীরভাগ ব্রাউজারই পুরোপুরি নতুন করে আবার ডম ট্রি তৈরী করে রেন্ডার করে) যেটা সময় সাপেক্ষ।
            </p>
            </h3> 
           <h3 className='question1'>
            Question-2: Props এবং state এর মধ্য পার্থক্য টা কি? 
            <p className='question-items'>
             উত্তরঃ
             Props <br />
             অপরিবর্তনীয়<br />
             যা প্রতিক্রিয়াকে দ্রুত রেফারেন্স চেক করতে দেয়<br />
             আপনার ভিউ-কন্ট্রোলার থেকে ডাটা পাস করতে ব্যবহৃত হয়<br />
             আপনার শীর্ষ স্তরের উপাদান<br />
             ভাল কর্মক্ষমতা আছে<br />
             শিশু উপাদানে ডেটা পাঠাতে এটি ব্যবহার করুন<br />

             State<br />

             আপনার ভিউ-কন্ট্রোলারে পরিচালনা করা উচিত<br />
             আপনার শীর্ষ স্তরের উপাদান<br />
             পরিবর্তনশীল<br />
             খারাপ কর্মক্ষমতা আছে<br />
             শিশু উপাদান থেকে অ্যাক্সেস করা উচিত নয়<br />
             পরিবর্তে প্রপস সঙ্গে এটি পাস<br />
            </p>
           </h3>
           <h3 className='question1'>
            Question-3: useEffect Data Load ছাড়া আর কি কি কাজে ব্যবহার করা হয়?
            <p className='question-items'>
                উত্তরঃ useEffect React এর একটা Hook এটা আমরা ডাটা ব্যবহার করি আমরা বাহিরের ডাটা বা API গুলো কে call করার জন্য আমরা যখনই ওয়েবসাইট টাকে Reload করি useEffect টা একবার কল করে আর আমরা যদি ডিপেন্ডেন্সি টা যদি খালি থাকে হাজার চেষ্টা করলেও ওয়েবসাইট নিজে নিজে লোড হবে নাহ তাই ডীপেন্ডডেন্সি টা দিয়ে দিতে হবে যতোক্ষন লোড নাহ হবে সে কল করতেই থাকে
            </p>
           </h3>
        </div>
    );
};

export default Question;